# 화면(콘솔)에 13579를 5번 출력하세요

# 화면(콘솔)에 13579를 5번 출력하는데, print를 1회 사용합니다

# 파이썬에서 제공하는 4가지 자료형을 출력하세요

# 변수 a에 들어있는 값을 출력하세요

# 변수 a의 값을 7로 바꾸세요

# a와 b에 들어있는 값을 교환하세요

# --------------------------------------------- #

# 산술 연산 7가지가 어떤 연산인지 알아내세요

# a를 b로 나눈 나머지를 % 연산자를 사용하지 말고 구하세요

# --------------------------------------------- #

# 아래 코드는 2개 변수의 값을 교환하는 코드입니다
# 임시 변수 c를 사용하고 있는데,
# 산술 연산자를 활용해서 임시 변수 c를 사용하지 않는 코드로 바꾸세요 (정수만 가능한 코드)
# 곱셈 버전의 코드를 먼저 구현하세요
# c = a
# a = b
# b = c

# 곱셈으로 되어 있는 위의 코드를 덧셈 버전으로 바꾸세요

# 산술 복합 연산자(+=)를 사용하는 코드로 수정하세요

# 'rain'과 777을 더해서 'rain777'을 만드세요

# 키보드로부터 입력받은 2개의 숫자를 더하세요 (input 함수 사용)
# 46 = 12 + 34

# --------------------------------------------- #

# 모든 관계 연산에 대해 결과를 표시하세요

# age에 들어있는 나이를 보고 10대인지 알려주세요
# 10대는 10살부터 19살까지.

# 논리 연산자 3개를 사용한 결과를 화면에 표시하세요

# --------------------------------------------- #

# 양의 정수가 홀수인지 짝수인지 알려주세요

# 양의 정수를 입력 받아서 자신보다 큰 첫 번째 짝수를 출력하세요 (input)
# 7: 8
# 8: 10

# 양의 정수를 입력 받아서 자신보다 큰 첫 번째 짝수를 출력하세요
# 이 문제를 풀 때, if문을 사용하지 마세요

# 양의 정수가 항상 짝수가 되게 만드세요 (2가지)

# --------------------------------------------- #

# 양의 실수 a에 들어있는 값 중에서 정수 부분만 추출하세요 (3가지)

# 양의 정수 b가 3의 배수이거나 5의 배수인지 알려주세요

# 정수 c가 음수인지 0인지 양수인지 알려주세요 (elif 사용 금지)

# --------------------------------------------- #

# 두 개의 정수를 더한 결과를 반환하는 함수를 만드세요

# 두 개의 정수 중에서 큰 숫자를 찾는 함수를 만드세요 (3가지)

# 4개의 정수 중에서 가장 큰 숫자를 찾는 함수를 만드세요 (3가지)

# --------------------------------------------- #

# 0부터 4까지 출력하는 반복문을 만드세요
# (range 함수 3가지 버전 사용)

# 0에서부터 24까지의 숫자를 출력하는 함수를 만드세요 (반복문 1개)
# 한 줄에 5개씩 출력합니다

# 0에서부터 24까지의 숫자를 출력하는 함수를 만드세요 (반복문 2개)
# 한 줄에 5개씩 출력합니다

# --------------------------------------------- #

# 점수를 학점으로 변환하는 함수를 만드세요
#  0 ~  60   F
# 61 ~  70   D
# 71 ~  80   C
# 81 ~  90   B
# 91 ~ 100   A

# 앞에서 만든 코드에 대해 입력 범위가 정해져 있지 않을 때의 코드로 수정하세요

# 정수를 입력 받는 input 함수를 5회 호출해서 최대값을 구하세요

# 정수를 입력 받는 input 함수를 여러 번 호출해서 최대값을 구하는 함수를 만드세요 (input 1회 이상)

# --------------------------------------------- #

# 리스트를 거꾸로 출력하세요

# --------------------------------------------- #

# 100보다 작은 난수 10개로 이루어진 리스트 반환하는 함수를 만드세요

# 리스트에 가장 큰 숫자를 찾는 함수를 만드세요

# 리스트에 포함된 홀수 중에서 가장 큰 숫자를 찾는 함수를 만드세요 (최소 1개는 홀수)

# 리스트를 거꾸로 뒤집는 함수를 만드세요

# --------------------------------------------- #

# 최대 5자리 양수에서 가장 큰 자릿수를 찾는 함수를 만드세요
# 62495 -> 9

# 앞쪽 절반을 출력하세요 (리스트 슬라이싱)
# 뒤쪽 절반을 출력하세요

# 짝수 번째만 출력하세요 (리스트 슬라이싱)
# 홀수 번째만 출력하세요

# 거꾸로 뒤집으세요

# 0~9까지의 정수를 while문으로 출력하세요

# input 함수로 0을 입력할 때까지의 합계를 구하세요 (while문, break문 사용)
# (break문은 반복문을 탈출할 때 사용합니다)

# --------------------------------------------- #

# 아래 코드를 반복문으로 바꾸세요
# print('*****')
# print('*****')
# print('*****')
# print('*****')

# 위의 코드에서 반복문 안쪽의 print 함수를 반복문으로 바꿔보세요

# 아래와 같은 모양으로 출력하는 함수를 작성하세요 (triangle_1)
#   0123
# 0 *---
# 1 **--
# 2 ***-
# 3 ****

# 아래와 같은 모양으로 출력하는 함수를 작성하세요 (triangle_2)
# ****
# ***
# **
# *

# 아래와 같은 모양으로 출력하는 함수를 작성하세요 (triangle_3)
#    *
#   **
#  ***
# ****

# 아래와 같은 모양으로 출력하는 함수를 작성하세요 (triangle_4)
# ****
#  ***
#   **
#    *

# --------------------------------------------- #

# 매개 변수를 3개 받는 함수를 만들고, 여러 가지 방법으로 호출해 보세요

# 기본 인자를 3개 받는 함수를 여러 가지 방법으로 호출해 보세요

# 가변인자를 매개변수로 받는 함수를 만들고, 여러 가지 방법으로 호출해 보세요

# --------------------------------------------- #

# 리스트에서 가장 큰 값과 가장 작은 값을 반환하는 함수를 만드세요 (find_min_max)

# 아래처럼 출력하는 코드를 만드세요 (반복문 2개)
#  0  1  2  3  4
#  5  6  7  8  9
# 10 11 12 13 14
# 15 16 17 18 19
# 20 21 22 23 24

# 문자열 리스트에 들어있는 문자열 전체 길이를 구하는 함수를 만드세요
a = ['book', 'sea', 'mouse']

# 정수 2차원 리스트로부터 가장 큰 값을 찾는 함수를 만드세요 (find_max_from_2d)
b = [[3, 5], [9, 1, 4, 8], [6, 2, 7]]

# poem.txt 파일을 읽어오는 함수를 만드세요

# --------------------------------------------- #

# 앞에서 만든 파일 읽기 함수를 파일을 읽어서 반환하는 함수로 수정하세요 (내용 전체가 포함된 문자열 1개)

# 앞에서 만든 파일 읽기 함수를 파일을 읽어서 반환하는 함수로 수정하세요 (내용 전체가 포함된 문자열 리스트)

# 1차원 리스트에 포함된 숫자들의 빈도를 구하세요

# 1차원 리스트로부터 중복된 숫자를 모두 제거하세요

# --------------------------------------------- #

# 딕셔너리의 keys 함수를 반복문과 연동하세요

# 딕셔너리의 items 함수를 반복문과 연동하세요

# 딕셔너리의 items 함수를 반복문과 연동해서 아래처럼 출력하세요
# 0 name kim
# 1 age 25
# 2 hobby climbing

