# 04_01_operator.py

# 관계는 항상 왼쪽이 기준

a, b = 1, 3

print(a > b, a >= b, a < b, a == b, a != b)  # 예, 아니오 로 나온다.

# 퀴즈
# age에 들어있는 나이를 보고 10대인지 알려주세요

age = 19

# print(10 <= age < 20)



# 퀴즈
# 논리 연산자 3개를 사용한 결과를 화면에 표시하세요

age = 22
print(10 <= age and age < 20)
print(10 <= age or age < 20)
print(not age < 20)

# 아래 코드는 2개 변수의 값을 교환하는 코드입니다
# 임시 변수 c를 사용하고 있는데,
# 산술 연산자를 활용해서 임시 변수 c를 사용하지 않는 코드로 바꾸세요 (정수만 가능한 코드)
# 곱셈 버전의 코드를 먼저 구현하세요
# c = a
# a = b
# b = c

# 곱셈으로 되어 있는 위의 코드를 덧셈 버전으로 바꾸세요

# 산술 복합 연산자(+=)를 사용하는 코드로 수정하세요

# 'rain'과 777을 더해서 'rain777'을 만드세요

# 키보드로부터 입력받은 2개의 숫자를 더하세요 (input 함수 사용)
# 46 = 12 + 34

# --------------------------------------------- #

# 모든 관계 연산에 대해 결과를 표시하세요

# age에 들어있는 나이를 보고 10대인지 알려주세요
# 10대는 10살부터 19살까지.

# 논리 연산자 3개를 사용한 결과를 화면에 표시하세요







